app/views/collaborators/_form.html.erb

SELECT "collaborators".* FROM "collaborators" WHERE "collaborators"."wiki_id" = ?  [["wiki_id", 16]]
---

    <% @wiki.collaborators.each do |user| %>