app/views/wikis/index.html.erb

      </h4>
     <% elsif wiki.private == true && (wiki.user == current_user || current_user.admin? || wiki.users.include?(current_user) )%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."wiki_id" = ? AND "users"."id" = ? LIMIT 1  [["wiki_id", 19], ["id", 9]]