app/controllers/charges_controller.rb

  def destroy
    current_user.standard!

    Wiki.where(user_id: current_user.id).each do |wiki|
      wiki.private = false
      wiki.save
---
SELECT "wikis".* FROM "wikis" WHERE "wikis"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 6]]
UPDATE "wikis" SET "private" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["private", "f"], ["updated_at", "2017-09-25 20:41:26.858483"], ["id", 16]]