app/controllers/collaborators_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "bo.will@pagac.info"]]
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 16]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 6]]
SELECT  1 AS one FROM "users" INNER JOIN "collaborators" ON "users"."id" = "collaborators"."user_id" WHERE "collaborators"."wiki_id" = ? AND "users"."id" = ? LIMIT 1  [[nil, 16], ["id", 1]]
INSERT INTO "collaborators" ("user_id", "wiki_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 8], ["wiki_id", 19], ["created_at", "2017-10-02 17:21:52.742623"], ["updated_at", "2017-10-02 17:21:52.742623"]]
---
    def create
        @user = User.where(email: params[:email]).take
        @wiki = Wiki.find(params[:wiki_id])

        if @user == nil
            flash[:notice] = "Is that your imaginary friend? \"#{@user}\" doesn't exist"
            redirect_to edit_wiki_path(@wiki)

        elsif @wiki.users.include?(@user)
            flash[:ntoice] = "A collaborator so nice you listed them twice! \"#{@user}\" is already a collaborator."
            redirect_to edit_wiki_path(@wiki)

        else
            @collaborator = Collaborator.new
            @collaborator.user_id = @user_id
            @collaborator.wiki_id = @wiki_id

            if @collaborator.save

SELECT  "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = ? LIMIT 1  [["id", nil]]
DELETE FROM "collaborators" WHERE "collaborators"."id" = ?  [["id", 19]]
---
    def destroy
        @collaborator = Collaborator.find(params[:id])
        @wiki = Collaborator.wiki

        if @collaborator.destroy