app/controllers/wikis_controller.rb

SELECT "wikis".* FROM "wikis"  ORDER BY created_at DESC
---
  def index
    @wikis = Wiki.all

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 15]]
---
  def show
    @wiki = Wiki.find(params[:id])

INSERT INTO "wikis" ("title", "body", "private", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "testing private wikis"], ["body", "private wiki body"], ["private", "t"], ["created_at", "2017-09-25 18:09:25.405288"], ["updated_at", "2017-09-25 18:09:25.405288"]]
---
  def create
    @wiki = Wiki.new
    @wiki.title = params[:wiki][:title]
    @wiki.body = params[:wiki][:body]
    @wiki.private = false

    if @wiki.save

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 15]]
---
  def edit
    @wiki = Wiki.find(params[:id])

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 15]]
UPDATE "wikis" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["title", "This is an edited wiki"], ["body", "i totally updated this wiki"], ["updated_at", "2017-09-21 18:16:08.392219"], ["id", 2]]
---
  def update
    @wiki = Wiki.find(params[:id])
    @wiki.title = params[:wiki][:title]
    @wiki.body = params[:wiki][:body]

    if @wiki.save

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 17]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 1]]
---
  def destroy
    @wiki = Wiki.find(params[:id])

    if @wiki.destroy